[
  {
    "name": "boston_bull",
    "shedding": 1,
    "active": 6,
    "aggression": 4,
    "space": 4,
    "time_commitment": 5,
    "description": "The Boston Bull is a small and friendly dog breed known for its gentle nature and affectionate demeanor. They require moderate activity levels and make great companions for families or individuals in various living spaces."
  },
  {
    "name": "dingo",
    "shedding": 2,
    "active": 8,
    "aggression": 6,
    "space": 7,
    "time_commitment": 7,
    "description": "Dingoes are wild dogs native to Australia. They have moderate shedding and high activity levels, requiring sufficient space and mental stimulation. Due to their wild nature, owning a dingo as a pet requires specialized knowledge and experience."
  },
  {
    "name": "pekinese",
    "shedding": 8,
    "active": 3,
    "aggression": 2,
    "space": 3,
    "time_commitment": 4,
    "description": "Pekinese, or Pekingese, is a small toy breed known for its long, flowing coat and charming personality. They have high grooming needs and prefer a relaxed and comfortable lifestyle. Pekinese are generally friendly and make great companions for individuals or families in smaller living spaces."
  },
  {
    "name": "bluetick",
    "shedding": 4,
    "active": 6,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Bluetick is a coonhound breed known for its striking coat pattern and excellent scent-tracking abilities. They have moderate shedding and require regular exercise and mental stimulation. Blueticks are generally friendly and can make loyal companions for active individuals or families."
  },
  {
    "name": "golden_retriever",
    "shedding": 6,
    "active": 9,
    "aggression": 3,
    "space": 8,
    "time_commitment": 8,
    "description": "The Golden Retriever is a popular and friendly dog breed known for its intelligence, loyalty, and gentle nature. They have a dense coat that requires regular grooming. Golden Retrievers are active dogs that thrive in families or households with plenty of space for exercise and play."
  },
  {
    "name": "bedlington_terrier",
    "shedding": 4,
    "active": 6,
    "aggression": 3,
    "space": 5,
    "time_commitment": 7,
    "description": "The Bedlington Terrier is a small breed known for its distinctive lamb-like appearance and energetic personality. They have a unique coat that requires regular grooming. Bedlington Terriers are active and intelligent dogs that enjoy being part of an active family."
  },
  {
    "name": "borzoi",
    "shedding": 5,
    "active": 7,
    "aggression": 4,
    "space": 8,
    "time_commitment": 8,
    "description": "The Borzoi, also known as the Russian Wolfhound, is a graceful and gentle dog breed. They have a luxurious, silky coat that requires regular grooming. Borzois are active and independent dogs that thrive in spacious environments and make loyal companions for individuals or families."
  },
  {
    "name": "basenji",
    "shedding": 3,
    "active": 7,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Basenji is a small and energetic dog breed known for its intelligence and unique vocalization, often described as yodel-like. They have a short coat that requires minimal grooming. Basenjis are active dogs that require mental stimulation and make devoted companions."
  },
  {
    "name": "scottish_deerhound",
    "shedding": 4,
    "active": 6,
    "aggression": 3,
    "space": 8,
    "time_commitment": 8,
    "description": "The Scottish Deerhound is a large and gentle dog breed known for its tall stature and calm temperament. They have a wiry or silky coat that requires regular grooming. Scottish Deerhounds are sighthounds and require regular exercise and socialization to thrive."
  },
  {
    "name": "shetland_sheepdog",
    "shedding": 5,
    "active": 7,
    "aggression": 3,
    "space": 6,
    "time_commitment": 7,
    "description": "The Shetland Sheepdog, also known as the Sheltie, is a small herding breed known for its intelligence and agility. They have a thick double coat that requires regular grooming. Shetland Sheepdogs are active and trainable dogs that excel in various dog sports and make loyal companions."
  },
  {
    "name": "walker_hound",
    "shedding": 3,
    "active": 8,
    "aggression": 4,
    "space": 7,
    "time_commitment": 7,
    "description": "The Walker Hound is a medium to large-sized coonhound breed known for its excellent tracking abilities and endurance. They have a short and dense coat that requires minimal grooming. Walker Hounds are active and require regular exercise and mental stimulation to be content."
  },
  {
    "name": "maltese_dog",
    "shedding": 2,
    "active": 5,
    "aggression": 2,
    "space": 3,
    "time_commitment": 6,
    "description": "The Maltese is a small and gentle toy breed known for its luxurious white coat and affectionate personality. They have low shedding but require regular grooming to maintain their coat. Maltese dogs are well-suited for apartment living and make loving companions."
  },
  {
    "name": "norfolk_terrier",
    "shedding": 3,
    "active": 6,
    "aggression": 4,
    "space": 4,
    "time_commitment": 6,
    "description": "The Norfolk Terrier is a small and energetic dog breed known for its wiry coat and lively personality. They have moderate grooming needs and require regular exercise. Norfolk Terriers are affectionate and make great companions for individuals or families in various living situations."
  },
  {
    "name": "african_hunting_dog",
    "shedding": 2,
    "active": 9,
    "aggression": 7,
    "space": 9,
    "time_commitment": 8,
    "description": "The African Hunting Dog, also known as the African Wild Dog, is a highly social and endangered species known for its cooperative hunting behavior. They have a short coat that requires minimal grooming. African Hunting Dogs are active and require extensive exercise and mental stimulation."
  },
  {
    "name": "wire-haired_fox_terrier",
    "shedding": 4,
    "active": 7,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Wire-haired Fox Terrier is a small and energetic dog breed known for its distinct appearance and lively personality. They have a wiry coat that requires regular grooming. Wire-haired Fox Terriers are active and intelligent dogs that thrive in an active family environment."
  },
  {
    "name": "redbone",
    "shedding": 3,
    "active": 7,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Redbone Coonhound is a medium to large-sized breed known for its friendly and energetic nature. They have a short and dense coat that requires minimal grooming. Redbones are active and require regular exercise and mental stimulation to be content."
  },
  {
    "name": "lakeland_terrier",
    "shedding": 4,
    "active": 6,
    "aggression": 5,
    "space": 5,
    "time_commitment": 7,
    "description": "The Lakeland Terrier is a small and sturdy dog breed known for its brave and confident personality. They have a dense, wiry coat that requires regular grooming. Lakeland Terriers are active dogs that require mental stimulation and make loyal companions."
  },
    {
    "name": "boxer",
    "shedding": 4,
    "active": 8,
    "aggression": 6,
    "space": 7,
    "time_commitment": 7,
    "description": "The Boxer is a medium to large-sized dog breed known for its muscular build and playful personality. They have a short coat that requires minimal grooming. Boxers are energetic and require regular exercise and mental stimulation to be content."
  },
  {
    "name": "doberman",
    "shedding": 3,
    "active": 7,
    "aggression": 8,
    "space": 10,
    "time_commitment": 10,
    "description": "The Doberman Pinscher is a powerful and intelligent dog breed known for its loyalty and athleticism. With their protective nature, it is crucial for owners to provide appropriate guidance and socialization to ensure they are well-behaved and safe in various situations."
  },
  {
    "name": "otterhound",
    "shedding": 5,
    "active": 7,
    "aggression": 4,
    "space": 9,
    "time_commitment": 8,
    "description": "The Otterhound is a large and friendly dog breed known for its unique appearance and excellent scent-tracking abilities. They have a dense, shaggy coat that requires regular grooming. Otterhounds are active dogs that require ample space and regular exercise."
  },
  {
    "name": "standard_schnauzer",
    "shedding": 2,
    "active": 7,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Standard Schnauzer is a medium-sized dog breed known for its intelligence, versatility, and distinctive beard and eyebrows. They have a wiry coat that requires regular grooming. Standard Schnauzers are active and require mental and physical stimulation."
  },
  {
    "name": "irish_water_spaniel",
    "shedding": 3,
    "active": 7,
    "aggression": 4,
    "space": 7,
    "time_commitment": 7,
    "description": "The Irish Water Spaniel is a medium to large-sized dog breed known for its curly and waterproof coat. They have moderate shedding and require regular grooming. Irish Water Spaniels are active and intelligent dogs that thrive in an active family environment."
  },
  {
    "name": "black-and-tan_coonhound",
    "shedding": 3,
    "active": 7,
    "aggression": 5,
    "space": 8,
    "time_commitment": 7,
    "description": "The Black and Tan Coonhound is a large scent hound breed known for its tracking abilities and distinctive coat color. They have a short coat that requires minimal grooming. Black and Tan Coonhounds are active and require regular exercise and mental stimulation."
  },
  {
    "name": "cairn",
    "shedding": 3,
    "active": 6,
    "aggression": 4,
    "space": 5,
    "time_commitment": 6,
    "description": "The Cairn Terrier is a small and spirited dog breed known for its shaggy and weather-resistant coat. They have moderate grooming needs and require regular exercise. Cairn Terriers are intelligent and make lively companions for individuals or families."
  },
  {
    "name": "affenpinscher",
    "shedding": 2,
    "active": 5,
    "aggression": 3,
    "space": 4,
    "time_commitment": 6,
    "description": "The Affenpinscher is a small and playful toy breed known for its distinctive monkey-like appearance. They have a wiry coat that requires regular grooming. Affenpinschers are active and intelligent dogs that make loyal companions."
  },
  {
    "name": "labrador_retriever",
    "shedding": 4,
    "active": 8,
    "aggression": 4,
    "space": 7,
    "time_commitment": 8,
    "description": "The Labrador Retriever is a medium to large-sized dog breed known for its friendly and outgoing personality. They have a short coat that requires minimal grooming. Labrador Retrievers are active and require regular exercise and mental stimulation."
  },
  {
    "name": "ibizan_hound",
    "shedding": 2,
    "active": 8,
    "aggression": 5,
    "space": 7,
    "time_commitment": 7,
    "description": "The Ibizan Hound is a medium-sized dog breed known for its slender build and graceful movement. They have a short coat that requires minimal grooming. Ibizan Hounds are active and require regular exercise and mental stimulation."
  },
  {
    "name": "english_setter",
    "shedding": 4,
    "active": 7,
    "aggression": 3,
    "space": 7,
    "time_commitment": 7,
    "description": "The English Setter is a medium to large-sized dog breed known for its elegant appearance and gentle nature. They have a medium-length coat that requires regular grooming. English Setters are active and require regular exercise and mental stimulation."
  },
  {
    "name": "weimaraner",
    "shedding": 3,
    "active": 9,
    "aggression": 5,
    "space": 8,
    "time_commitment": 8,
    "description": "The Weimaraner is a large and athletic dog breed known for its sleek silver-gray coat and striking eyes. They have a short coat that requires minimal grooming. Weimaraners are highly active and require regular exercise and mental stimulation."
  },
  {
    "name": "giant_schnauzer",
    "shedding": 3,
    "active": 8,
    "aggression": 7,
    "space": 7,
    "time_commitment": 8,
    "description": "The Giant Schnauzer is a large and powerful dog breed known for its loyalty and protective nature. They have a dense, wiry coat that requires regular grooming. Giant Schnauzers are active and require mental and physical stimulation."
  },
  {
    "name": "groenendael",
    "shedding": 4,
    "active": 8,
    "aggression": 5,
    "space": 7,
    "time_commitment": 8,
    "description": "The Groenendael is a large and intelligent dog breed that is a variety of the Belgian Shepherd. They have a long and dense coat that requires regular grooming. Groenendaels are active and require mental and physical stimulation."
  },
  {
    "name": "dhole",
    "shedding": 3,
    "active": 8,
    "aggression": 7,
    "space": 9,
    "time_commitment": 8,
    "description": "The Dhole, also known as the Asiatic wild dog, is a highly social and endangered species known for its cooperative hunting behavior. They have a short coat that requires minimal grooming. Dholes are active and require extensive exercise and mental stimulation."
  },
  {
    "name": "toy_poodle",
    "shedding": 1,
    "active": 6,
    "aggression": 3,
    "space": 4,
    "time_commitment": 6,
    "description": "The Toy Poodle is a small and intelligent breed known for its curly coat and lively personality. They have a hypoallergenic coat that requires regular grooming. Toy Poodles are active and require mental and physical stimulation."
  },
  {
    "name": "border_terrier",
    "shedding": 3,
    "active": 7,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Border Terrier is a small and energetic dog breed known for its rough double coat and friendly nature. They have moderate grooming needs and require regular exercise. Border Terriers are intelligent and make great companions for active individuals or families."
  },
  {
    "name": "tibetan_terrier",
    "shedding": 5,
    "active": 6,
    "aggression": 3,
    "space": 5,
    "time_commitment": 7,
    "description": "The Tibetan Terrier is a medium-sized dog breed known for its long and profuse coat. They have a non-shedding coat that requires regular grooming. Tibetan Terriers are friendly and make great companions for individuals or families."
  },
  {
    "name": "norwegian_elkhound",
    "shedding": 4,
    "active": 7,
    "aggression": 5,
    "space": 7,
    "time_commitment": 7,
    "description": "The Norwegian Elkhound is a medium-sized dog breed known for its thick, weather-resistant coat and strong hunting instincts. They have moderate grooming needs and require regular exercise. Norwegian Elkhounds are loyal and make great companions for active individuals or families."
  },
  {
    "name": "shih-tzu",
    "shedding": 5,
    "active": 4,
    "aggression": 3,
    "space": 4,
    "time_commitment": 6,
    "description": "The Shih Tzu is a small and affectionate toy breed known for its long and flowing coat. They have hair-like fur that requires regular grooming. Shih Tzus are relatively low-energy dogs that make loving companions."
  },
  {
    "name": "irish_terrier",
    "shedding": 4,
    "active": 7,
    "aggression": 6,
    "space": 6,
    "time_commitment": 7,
    "description": "The Irish Terrier is a medium-sized dog breed known for its fiery red coat and spirited personality. They have a dense, wiry coat that requires regular grooming. Irish Terriers are active and require mental and physical stimulation."
  },
  {
    "name": "kuvasz",
    "shedding": 4,
    "active": 7,
    "aggression": 6,
    "space": 8,
    "time_commitment": 8,
    "description": "The Kuvasz is a large and protective dog breed known for its loyalty and guarding instincts. They have a thick double coat that requires regular grooming. Kuvasz dogs are active and require mental and physical stimulation."
  },
  {
    "name": "german_shepherd",
    "shedding": 5,
    "active": 9,
    "aggression": 7,
    "space": 8,
    "time_commitment": 9,
    "description": "The German Shepherd is a large and versatile dog breed known for its intelligence, loyalty, and working capabilities. They have a double coat that sheds heavily and requires regular grooming. German Shepherds are active and require mental and physical stimulation."
  },
  {
    "name": "greater_swiss_mountain_dog",
    "shedding": 4,
    "active": 7,
    "aggression": 5,
    "space": 8,
    "time_commitment": 8,
    "description": "The Greater Swiss Mountain Dog is a large and sturdy breed known for its gentle and friendly nature. They have a short coat that requires minimal grooming. Greater Swiss Mountain Dogs are active and require regular exercise and mental stimulation."
  },
   {
    "name": "basset",
    "shedding": 5,
    "active": 4,
    "aggression": 3,
    "space": 4,
    "time_commitment": 6,
    "description": "Bassets are known for their long ears, short legs, and friendly disposition. They have a moderate level of shedding and require regular exercise to maintain a healthy weight."
  },
  {
    "name": "australian_terrier",
    "shedding": 3,
    "active": 6,
    "aggression": 4,
    "space": 4,
    "time_commitment": 5,
    "description": "Australian Terriers are small, lively dogs with a wiry coat. They are relatively low shedding and require moderate exercise. They are known for their loyalty and make good family pets."
  },
  {
    "name": "schipperke",
    "shedding": 4,
    "active": 8,
    "aggression": 4,
    "space": 3,
    "time_commitment": 7,
    "description": "Schipperkes are small, energetic dogs with a thick black coat. They are known for their intelligence and independence. They require regular exercise and mental stimulation to prevent boredom."
  },
  {
    "name": "rhodesian_ridgeback",
    "shedding": 4,
    "active": 7,
    "aggression": 6,
    "space": 6,
    "time_commitment": 8,
    "description": "Rhodesian Ridgebacks are large and muscular dogs known for their distinctive ridge of hair on their backs. They have a short coat and moderate shedding. They require regular exercise and socialization."
  },
  {
    "name": "irish_setter",
    "shedding": 5,
    "active": 9,
    "aggression": 4,
    "space": 5,
    "time_commitment": 7,
    "description": "Irish Setters are medium to large-sized dogs with a beautiful red coat. They are active and require plenty of exercise and mental stimulation. They are known for their friendly and outgoing nature."
  },
  {
    "name": "appenzeller",
    "shedding": 3,
    "active": 8,
    "aggression": 5,
    "space": 5,
    "time_commitment": 7,
    "description": "Appenzellers are medium-sized dogs with a short coat and distinctive tricolor markings. They are highly active and require regular exercise and mental stimulation. They are known for their agility and intelligence."
  },
  {
    "name": "bloodhound",
    "shedding": 5,
    "active": 3,
    "aggression": 2,
    "space": 6,
    "time_commitment": 7,
    "description": "Bloodhounds are large, scent hounds known for their exceptional tracking abilities. They have a short coat that sheds moderately. Bloodhounds are generally laid-back but require regular exercise and mental stimulation."
  },
  {
    "name": "samoyed",
    "shedding": 8,
    "active": 7,
    "aggression": 3,
    "space": 6,
    "time_commitment": 8,
    "description": "Samoyeds are large, fluffy dogs with a friendly and gentle nature. They have a thick double coat that requires regular grooming. Samoyeds are active and require regular exercise and mental stimulation."
  },
  {
    "name": "miniature_schnauzer",
    "shedding": 2,
    "active": 6,
    "aggression": 4,
    "space": 4,
    "time_commitment": 6,
    "description": "Miniature Schnauzers are small, energetic dogs with a distinctive beard and eyebrows. They have a wiry coat that requires regular grooming. They are generally friendly, intelligent, and make good family pets."
  },
  {
    "name": "brittany_spaniel",
    "shedding": 3,
    "active": 8,
    "aggression": 3,
    "space": 5,
    "time_commitment": 7,
    "description": "Brittany Spaniels are medium-sized dogs known for their energy and athleticism. They have a medium-length coat that requires regular grooming. They are highly active and require plenty of exercise and mental stimulation."
  },
  {
    "name": "kelpie",
    "shedding": 4,
    "active": 9,
    "aggression": 4,
    "space": 5,
    "time_commitment": 8,
    "description": "Kelpies are medium-sized herding dogs known for their intelligence and agility. They have a short coat that requires minimal grooming. Kelpies are highly active and excel in various dog sports and working roles."
  },
  {
    "name": "papillon",
    "shedding": 3,
    "active": 8,
    "aggression": 3,
    "space": 3,
    "time_commitment": 6,
    "description": "Papillons are small, elegant dogs with distinctive butterfly-like ears. They have a long, flowing coat that requires regular grooming. Papillons are active, intelligent, and make good companion pets."
  },
  {
    "name": "border_collie",
    "shedding": 5,
    "active": 10,
    "aggression": 4,
    "space": 6,
    "time_commitment": 9,
    "description": "Border Collies are highly intelligent and energetic herding dogs. They have a medium-length coat that requires regular grooming. Border Collies excel in various dog sports and working roles and require plenty of exercise and mental stimulation."
  },
  {
    "name": "entlebucher",
    "shedding": 4,
    "active": 7,
    "aggression": 5,
    "space": 5,
    "time_commitment": 7,
    "description": "Entlebuchers are medium-sized herding dogs with a short, tri-colored coat. They are active and require regular exercise and mental stimulation. Entlebuchers are known for their loyalty and make good family companions."
  },
  {
    "name": "collie",
    "shedding": 7,
    "active": 7,
    "aggression": 3,
    "space": 5,
    "time_commitment": 7,
    "description": "Collies are medium to large-sized dogs known for their intelligence and loyalty. They have a thick coat that requires regular grooming. Collies are active and require regular exercise and mental stimulation."
  },
  {
    "name": "malamute",
    "shedding": 8,
    "active": 9,
    "aggression": 4,
    "space": 7,
    "time_commitment": 8,
    "description": "Alaskan Malamutes are large, powerful dogs with a thick double coat. They shed heavily and require regular grooming. Malamutes are active and require plenty of exercise and mental stimulation."
  },
  {
    "name": "welsh_springer_spaniel",
    "shedding": 4,
    "active": 8,
    "aggression": 3,
    "space": 5,
    "time_commitment": 7,
    "description": "Welsh Springer Spaniels are medium-sized dogs with a beautiful red and white coat. They have moderate shedding and require regular grooming. Welsh Springers are active, friendly, and make good family pets."
  },
  {
    "name": "basset",
    "shedding": 3,
    "active": 4,
    "aggression": 3,
    "space": 5,
    "time_commitment": 6,
    "description": "The Basset Hound is a medium-sized dog breed known for its long ears and sad, droopy eyes. They have a short coat that requires minimal grooming. Bassets are generally calm and friendly dogs that make great companions."
  },
  {
    "name": "australian_terrier",
    "shedding": 2,
    "active": 6,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Australian Terrier is a small and lively dog breed known for its rough coat and spirited personality. They have a low-shedding coat that requires regular grooming. Australian Terriers are active and require mental and physical stimulation."
  },
  {
    "name": "schipperke",
    "shedding": 4,
    "active": 7,
    "aggression": 5,
    "space": 6,
    "time_commitment": 7,
    "description": "The Schipperke is a small and intelligent dog breed known for its black, fox-like appearance. They have a dense, double coat that requires regular grooming. Schipperkes are energetic and require mental and physical stimulation."
  },
  {
    "name": "rhodesian_ridgeback",
    "shedding": 4,
    "active": 8,
    "aggression": 7,
    "space": 8,
    "time_commitment": 8,
    "description": "The Rhodesian Ridgeback is a large and athletic dog breed known for its distinctive ridge of hair along its back. They have a short coat that requires minimal grooming. Ridgebacks are active and require regular exercise and mental stimulation."
  },
  {
    "name": "irish_setter",
    "shedding": 4,
    "active": 8,
    "aggression": 4,
    "space": 7,
    "time_commitment": 8,
    "description": "The Irish Setter is a medium to large-sized dog breed known for its beautiful red coat and friendly personality. They have a long, silky coat that requires regular grooming. Irish Setters are active and require regular exercise and mental stimulation."
  },
  {
    "name": "appenzeller",
    "shedding": 3,
    "active": 7,
    "aggression": 6,
    "space": 7,
    "time_commitment": 8,
    "description": "The Appenzeller Sennenhund, also known as the Appenzeller Mountain Dog, is a medium-sized Swiss breed known for its agility and herding abilities. They have a short coat that requires minimal grooming. Appenzellers are active and require mental and physical stimulation."
  },
  {
    "name": "bloodhound",
    "shedding": 4,
    "active": 5,
    "aggression": 3,
    "space": 6,
    "time_commitment": 7,
    "description": "The Bloodhound is a large and powerful dog breed known for its exceptional sense of smell and droopy skin. They have a short coat that requires minimal grooming. Bloodhounds are generally friendly and make devoted family pets."
  },
  {
    "name": "samoyed",
    "shedding": 5,
    "active": 7,
    "aggression": 4,
    "space": 8,
    "time_commitment": 8,
    "description": "The Samoyed is a large and fluffy dog breed known for its friendly and gentle nature. They have a thick, double coat that requires regular grooming. Samoyeds are active and require regular exercise and mental stimulation."
  },
  {
    "name": "miniature_schnauzer",
    "shedding": 2,
    "active": 6,
    "aggression": 4,
    "space": 6,
    "time_commitment": 7,
    "description": "The Miniature Schnauzer is a small and spirited dog breed known for its distinctive mustache and beard. They have a wiry coat that requires regular grooming. Miniature Schnauzers are intelligent and make great companions."
  },
  {
    "name": "brittany_spaniel",
    "shedding": 3,
    "active": 8,
    "aggression": 4,
    "space": 7,
    "time_commitment": 8,
    "description": "The Brittany Spaniel, often referred to as the Brittany, is a medium-sized dog breed known for its agility and hunting abilities. They have a medium-length coat that requires regular grooming. Brittanys are active and require regular exercise and mental stimulation."
  },
  {
    "name": "kelpie",
    "shedding": 3,
    "active": 9,
    "aggression": 5,
    "space": 7,
    "time_commitment": 8,
    "description": "The Kelpie is a medium-sized herding dog breed known for its intelligence and working capabilities. They have a short coat that requires minimal grooming. Kelpies are highly active and require mental and physical stimulation."
  },
  {
    "name": "papillon",
    "shedding": 3,
    "active": 7,
    "aggression": 3,
    "space": 5,
    "time_commitment": 6,
    "description": "The Papillon is a small and elegant toy breed known for its butterfly-like ears. They have a long, silky coat that requires regular grooming. Papillons are active and enjoy participating in various activities."
  },
  {
    "name": "border_collie",
    "shedding": 4,
    "active": 10,
    "aggression": 4,
    "space": 8,
    "time_commitment": 9,
    "description": "The Border Collie is a highly intelligent and energetic dog breed known for its herding abilities. They have a medium-length coat that requires regular grooming. Border Collies are active and require extensive exercise and mental stimulation."
  },
  {
    "name": "entlebucher",
    "shedding": 3,
    "active": 7,
    "aggression": 5,
    "space": 7,
    "time_commitment": 7,
    "description": "The Entlebucher Mountain Dog, also known as the Entlebucher Sennenhund, is a medium-sized Swiss breed known for its herding capabilities and loyalty. They have a short coat that requires minimal grooming. Entlebuchers are active and require mental and physical stimulation."
  },
  {
    "name": "collie",
    "shedding": 5,
    "active": 7,
    "aggression": 4,
    "space": 8,
    "time_commitment": 8,
    "description": "The Collie is a medium to large-sized dog breed known for its intelligence and loyalty. They have a long, dense coat that requires regular grooming. Collies are active and require regular exercise and mental stimulation."
  },
  {
    "name": "malamute",
    "shedding": 5,
    "active": 9,
    "aggression": 6,
    "space": 8,
    "time_commitment": 9,
    "description": "The Alaskan Malamute is a large and powerful dog breed known for its strength and endurance. They have a thick, double coat that requires regular grooming. Malamutes are active and require regular exercise and mental stimulation."
  },
  {
    "name": "welsh_springer_spaniel",
    "shedding": 4,
    "active": 8,
    "aggression": 4,
    "space": 7,
    "time_commitment": 8,
    "description": "The Welsh Springer Spaniel is a medium-sized dog breed known for its friendly and affectionate nature. They have a medium-length coat that requires regular grooming. Welsh Springers are active and require regular exercise and mental stimulation."
  },
  {
    "name": "chihuahua",
    "shedding": 2,
    "active": 5,
    "aggression": 2,
    "space": 4,
    "time_commitment": 5,
    "description": "The Chihuahua is a small and spirited toy breed known for its bold and confident personality. They have a short coat that requires minimal grooming. Chihuahuas are active but can adapt well to apartment living."
  },
  {
    "name": "saluki",
    "shedding": 3,
    "active": 8,
    "aggression": 4,
    "space": 7,
    "time_commitment": 8,
    "description": "The Saluki is a graceful and athletic dog breed known for its speed and endurance. They have a short coat that requires minimal grooming. Salukis are active and require regular exercise and mental stimulation."
  },
  {
    "name": "pug",
    "shedding": 4,
    "active": 5,
    "aggression": 2,
    "space": 4,
    "time_commitment": 6,
    "description": "The Pug is a small and affectionate dog breed known for its wrinkled face and charming personality. They have a short coat that requires minimal grooming. Pugs are generally laid-back and make great companions."
  },
  {
    "name": "malinois",
    "shedding": 4,
    "active": 9,
    "aggression": 7,
    "space": 8,
    "time_commitment": 9,
    "description": "The Belgian Malinois is a medium to large-sized dog breed known for its intelligence and working abilities. They have a short coat that requires minimal grooming. Malinois dogs are highly active and require extensive exercise and mental stimulation."
  },
  {
    "name": "komondor",
    "shedding": 1,
    "active": 4,
    "aggression": 7,
    "space": 8,
    "time_commitment": 7,
    "description": "The Komondor is a large and distinctive dog breed known for its unique corded coat that resembles dreadlocks. Despite their very furry appearance, komondors do not shed. They have a dense, corded coat that requires special care. Komondors are protective and require firm training and socialization."
  },
  {
    "name": "airedale",
    "shedding": 4,
    "active": 8,
    "aggression": 6,
    "space": 7,
    "time_commitment": 8,
    "description": "The Airedale Terrier is a large and versatile dog breed known for its intelligence and loyalty. They have a dense, wiry coat that requires regular grooming. Airedales are active and require mental and physical stimulation."
  },
  {
    "name": "leonberg",
    "shedding": 4,
    "active": 6,
    "aggression": 4,
    "space": 8,
    "time_commitment": 8,
    "description": "The Leonberger is a giant dog breed known for its gentle and friendly nature. They have a thick, water-resistant coat that requires regular grooming. Leonbergers are active and require regular exercise and mental stimulation."
  },
  {
    "name": "mexican_hairless",
    "shedding": 1,
    "active": 6,
    "aggression": 3,
    "space": 5,
    "time_commitment": 6,
    "description": "The Mexican Hairless, also known as the Xoloitzcuintli, is a unique and ancient breed known for its hairless appearance. They come in three sizes: toy, miniature, and standard. Mexican Hairless dogs are generally calm and make loyal companions."
  },
  {
    "name": "bull_mastiff",
    "shedding": 3,
    "active": 5,
    "aggression": 7,
    "space": 6,
    "time_commitment": 7,
    "description": "The Bull Mastiff is a large and powerful dog breed known for its protective and loyal nature. They have a short coat that requires minimal grooming. Bull Mastiffs are generally calm and make great family companions."
  },
  {
    "name": "bernese_mountain_dog",
    "shedding": 4,
    "active": 7,
    "aggression": 4,
    "space": 8,
    "time_commitment": 8,
    "description": "The Bernese Mountain Dog is a large and gentle dog breed known for its striking tri-color coat and friendly disposition. They have a long, thick coat that requires regular grooming. Bernese Mountain Dogs are active and require regular exercise and mental stimulation."
  },
  {
    "name": "american_staffordshire_terrier",
    "shedding": 3,
    "active": 8,
    "aggression": 7,
    "space": 7,
    "time_commitment": 8,
    "description": "The American Staffordshire Terrier, often referred to as AmStaff, is a medium to large-sized dog breed known for its strength and loyalty. They have a short coat that requires minimal grooming. AmStaffs are active and require regular exercise and mental stimulation."
  },
  {
    "name": "lhasa",
    "shedding": 4,
    "active": 5,
    "aggression": 3,
    "space": 5,
    "time_commitment": 6,
    "description": "The Lhasa Apso is a small and independent dog breed known for its long, flowing coat. They require regular grooming to maintain their coat. Lhasas are generally calm and make good companions for individuals or families."
  },
  {
    "name": "cardigan",
    "shedding": 3,
    "active": 7,
    "aggression": 4,
    "space": 7,
    "time_commitment": 7,
    "description": "The Cardigan Welsh Corgi, often referred to as the Cardigan, is a small and sturdy dog breed known for its long body and short legs. They have a medium-length coat that requires regular grooming. Cardigans are active and require regular exercise and mental stimulation."
  }
]